ZHH-start/STM32F103C8-smartbike-TailLight/Drive/Device/MPU6050.c
#include "stm32f10x.h" // Device header
#include "IIC.h"
#include "USART.h"
#include "MPU6050.h"

int16_t AX, AY, AZ, GX, GY, GZ;

void MPU6050_WriteReg(uint8_t RegAddress, uint8_t Data)
{
    MyI2C_Start();
    MyI2C_SendByte(MPU6050_ADDRESS);
    MyI2C_ReceiveAck();
    MyI2C_SendByte(RegAddress);
    MyI2C_ReceiveAck();
    MyI2C_SendByte(Data);
    MyI2C_ReceiveAck();
    MyI2C_Stop();
}

uint8_t MPU6050_ReadReg(uint8_t RegAddress)
{
    uint8_t Data;

    MyI2C_Start();
    MyI2C_SendByte(MPU6050_ADDRESS);
    MyI2C_ReceiveAck();
    MyI2C_SendByte(RegAddress);
    MyI2C_ReceiveAck();

    MyI2C_Start();
    MyI2C_SendByte(MPU6050_ADDRESS | 0x01);
    MyI2C_ReceiveAck();
    Data = MyI2C_ReceiveByte();
    MyI2C_SendAck(1);
    MyI2C_Stop();

    return Data;
}

void MPU6050_Init(void)
{
    MyI2C_Init();
	MPU6050_WriteReg(MPU6050_PWR_MGMT_1, 0x01);
	MPU6050_WriteReg(MPU6050_PWR_MGMT_2, 0x00);
	MPU6050_WriteReg(MPU6050_SMPLRT_DIV, 0x09);
	MPU6050_WriteReg(MPU6050_CONFIG, 0x06);
	MPU6050_WriteReg(MPU6050_GYRO_CONFIG, 0x18);
	MPU6050_WriteReg(MPU6050_ACCEL_CONFIG, 0x18);
}

uint8_t MPU6050_GetID(void)
{
    return MPU6050_ReadReg(MPU6050_WHO_AM_I);
}

// void MPU6050_GetData(int16_t AX, int16_t AY, int16_t AZ,
//                      int16_t GX, int16_t GY, int16_t GZ)
void MPU6050_GetData()
{
    uint8_t DataH, DataL;

    DataH = MPU6050_ReadReg(MPU6050_ACCEL_XOUT_H);
    DataL = MPU6050_ReadReg(MPU6050_ACCEL_XOUT_L);
    AX = (DataH << 8) | DataL;

    DataH = MPU6050_ReadReg(MPU6050_ACCEL_YOUT_H);
    DataL = MPU6050_ReadReg(MPU6050_ACCEL_YOUT_L);
    AY = (DataH << 8) | DataL;

    DataH = MPU6050_ReadReg(MPU6050_ACCEL_ZOUT_H);
    DataL = MPU6050_ReadReg(MPU6050_ACCEL_ZOUT_L);
    AZ = (DataH << 8) | DataL;

    DataH  = MPU6050_ReadReg(MPU6050_GYRO_XOUT_H);
    DataL  = MPU6050_ReadReg(MPU6050_GYRO_XOUT_L);
    GX = (DataH << 8) | DataL;

    DataH  = MPU6050_ReadReg(MPU6050_GYRO_YOUT_H);
    DataL  = MPU6050_ReadReg(MPU6050_GYRO_YOUT_L);
    GY = (DataH << 8) | DataL;

    DataH  = MPU6050_ReadReg(MPU6050_GYRO_ZOUT_H);
    DataL  = MPU6050_ReadReg(MPU6050_GYRO_ZOUT_L);
    GZ = (DataH << 8) | DataL;
}
